posts/key-bindings-of-spacemacs/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="description" content="常用Spacemacs快捷键">
<meta name="viewport" content="width=device-width">
<title>Key Bindings of Spacemacs | EnJoey!</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://JoeYZXd.github.io/posts/key-bindings-of-spacemacs/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Joey.ZhangXiaodong">
<meta property="og:site_name" content="EnJoey!">
<meta property="og:title" content="Key Bindings of Spacemacs">
<meta property="og:url" content="http://JoeYZXd.github.io/posts/key-bindings-of-spacemacs/">
<meta property="og:description" content="常用Spacemacs快捷键">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-04-18T16:48:32+08:00">
<meta property="article:tag" content="Emacs">
<meta property="article:tag" content="Key-Binding">
<meta property="article:tag" content="Spacemacs">
</head>
<body>
    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="http://JoeYZXd.github.io/" title="EnJoey!" rel="home">
                EnJoey!
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../archive.html">Archives</a></li>
                <li><a href="../../categories/">Categories</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                Key Bindings of Spacemacs
            </div>
        </div>
    </div>

    <div class="post-meta">
      <div class="container">
	<div class="meta clearfix">
	  <div class="authordate">
	    <time class="timeago" datetime="2018-04-18T16:48:32+08:00">2018/04/18</time>
</div>
	  <div class="post-tags">
	    <div class="tag">
	      <a href="../../categories/emacs/" rel="tag">Emacs</a>
	    </div>
	    <div class="tag">
	      <a href="../../categories/key-binding/" rel="tag">Key-Binding</a>
	    </div>
	    <div class="tag">
	      <a href="../../categories/spacemacs/" rel="tag">Spacemacs</a>
	    </div>
	  </div>
	</div>
      </div>
    </div>
    
    
    <div id="post-main" class="main">
        <div class="container">
        <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">视图相关</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="left">
<col class="left">
<col class="left">
</colgroup>
<thead><tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">Keys</th>
<th scope="col" class="left">Description</th>
</tr></thead>
<tbody>
<tr>
<td class="left">Zoom in</td>
<td class="left"><code>SPC z f</code></td>
<td class="left">
<code>+</code> / <code>=</code>
</td>
</tr>
<tr>
<td class="left">Zoom out</td>
<td class="left"><code>SPC z f</code></td>
<td class="left"><code>-</code></td>
</tr>
<tr>
<td class="left">Zoom reset</td>
<td class="left"><code>SPC z f</code></td>
<td class="left"><code>0</code></td>
</tr>
<tr>
<td class="left">Show Line Number</td>
<td class="left"><code>SPC t n</code></td>
<td class="left"> </td>
</tr>
<tr>
<td class="left">Show relative line number</td>
<td class="left"><code>SPC t r</code></td>
<td class="left"> </td>
</tr>
<tr>
<td class="left">Comment Line</td>
<td class="left"><code>g c c</code></td>
<td class="left"> </td>
</tr>
<tr>
<td class="left">Comment Downward Lines</td>
<td class="left"><code>g c 5 j</code></td>
<td class="left"> </td>
</tr>
<tr>
<td class="left">Comment Forward Lines</td>
<td class="left"><code>g c 5 k</code></td>
<td class="left"> </td>
</tr>
<tr>
<td class="left">Comment Selected Lines</td>
<td class="left"><code>g c</code></td>
<td class="left">In Visual Mode, First Select Lines</td>
</tr>
<tr>
<td class="left">Indent Selected Lines</td>
<td class="left"><code>C-M-\</code></td>
<td class="left">Defined in joey-misc layer</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">编辑模式</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="left">
<col class="left">
<col class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Function</td>
<td class="left">Keys</td>
<td class="left">Description</td>
</tr>
<tr>
<td class="left">Exit Insert Mode</td>
<td class="left"><code>fd</code></td>
<td class="left">Quickly enter fd</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">FlySpell Mode</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="left">
<col class="left">
<col class="left">
</colgroup>
<tbody><tr>
<td class="left">Change Word</td>
<td class="left"><code>SPC S c</code></td>
<td class="left">
<code>C-j</code> downward, <code>C-k</code> upward</td>
</tr></tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Dired Mode</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="left">
<col class="left">
<col class="left">
</colgroup>
<tbody>
<tr>
<td class="left">eDiff</td>
<td class="left"><code>e</code></td>
<td class="left">first mark the 2 files want to be compared</td>
</tr>
<tr>
<td class="left">Open parent directory</td>
<td class="left"><code>C-k</code></td>
<td class="left">Open parent directory in the same buffer</td>
</tr>
</tbody>
</table>
</div>
</div>
        
    


        </div>
    </div>

    
    <footer><div class="container">
            <div class="social">



                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2018         <a href="mailto:joy.zhangxiaodong@gmail.com">Joey.ZhangXiaodong</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
